app/controllers/allergies_controller.rb

INSERT INTO "allergies" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Mango"], ["user_id", 11], ["created_at", "2023-03-31 10:48:27.197454"], ["updated_at", "2023-03-31 10:48:27.197454"]]
---
       def create
        user_allergy = Allergy.create(allowed_params)