app/controllers/allergies_controller.rb

    def index
        user_allergies = Allergy.all
---
SELECT "allergies".* FROM "allergies" WHERE "allergies"."user_id" = ?  [["user_id", 1]]