app/controllers/recipes_controller.rb

    def create
        new_recipe = Recipe.create(allowed_params)
---
INSERT INTO "recipes" ("title", "instructions", "description", "cuisine", "recipe_image", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def destroy
        delete_recipe = Recipe.find(params[:id])
        delete_recipe.destroy
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "recipes" WHERE "recipes"."id" = ?  [["id", 1]]

    def index
        all_recipes = Recipe.all
---
SELECT "recipes".* FROM "recipes"

    def show
        find_recipe = Recipe.find(params[:id])
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def search
    search_response = Recipe.where('title LIKE ? OR  cuisine LIKE ?', "%#{params[:search]}%", "%#{params[:search]}%")
---
SELECT "recipes".* FROM "recipes" WHERE (title LIKE '%Beef%' OR  cuisine LIKE '%Beef%')

    def sort_oldest
        sorted_recipes = Recipe.all.order(id: :desc)
---
SELECT "recipes".* FROM "recipes" ORDER BY "recipes"."id" DESC

    def sort_newest
        sorted_recipes = Recipe.all.order(id: :asc)
---
SELECT "recipes".* FROM "recipes" ORDER BY "recipes"."id" ASC