app/controllers/registrations_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "allergy_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    respond_to do |format|
      if @user.save